/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[date quelconque]@";
"%@ %[Today]@" = "%1$@ %2$[aujourd’hui]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[depuis hier]@";
"%@ %[This week]@" = "%1$@ %2$[cette semaine]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[ces 2 dernières semaines]@";
"%@ %[This month]@" = "%1$@ %2$[ce mois-ci]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[ces 2 derniers mois]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[quelconque]@";
"%@ %[Yes]@" = "%1$@ %2$[oui]@";
"%@ %[No]@" = "%1$@ %2$[non]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[contient]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[commence par]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[se termine par]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[est]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[exactement le]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[avant le]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[après le]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[est supérieure à]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[est inférieure à]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[ces derniers]@ %3$@ %4$[jours]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[ces dernières]@ %3$@ %4$[semaines]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[ces derniers]@ %3$@ %4$[mois]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[ces dernières]@ %3$@ %4$[années]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Espace colorimétrique]@ %2$[Tout espace colorimétrique]@";
"%[Color Space]@ %[RGB]@" = "%1$[Espace colorimétrique]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Espace colorimétrique]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Espace colorimétrique]@ %2$[Niveaux de gris]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Le contenu]@ comporte %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Durée]@ %2$[supérieure à]@ %3$@ %4$[min.]@ %5$@ %6$[sec.]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Durée]@ %2$[inférieure à]@ %3$@ %4$[min.]@ %5$@ %6$[sec.]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Mots-clés]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Les mots-clés]@ contiennent %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Le type]@ est %2$[quelconque]@";
"%[Kind]@ is %[Images]@" = "%1$[Le type]@ est %2$[images]@";
"%[Kind]@ is %[Text]@" = "%1$[Le type]@ est %2$[texte]@";
"%[Kind]@ is %[PDF]@" = "%1$[Le type]@ est %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Le type]@ est %2$[vidéos]@";
"%[Kind]@ is %[Music]@" = "%1$[Le type]@ est %2$[musique]@";
"%[Kind]@ is %[Documents]@" = "%1$[Le type]@ est %2$[documents]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Le type]@ est %2$[présentations]@";
"%[Kind]@ is %[Folders]@" = "%1$[Le type]@ est %2$[dossiers]@";
"%[Kind]@ is %[Applications]@" = "%1$[Le type]@ est %2$[applications]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Type]@ est %2$[Autres…]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Étiquette]@ est %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Dernière ouverture]@ %2$[date quelconque]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Dernière modification]@ %2$[date quelconque]@";
"%[Created]@ %[Any Date]@" = "%1$[Créé]@ %2$[à une date quelconque]@";
"%[Last Opened]@ %[Today]@" = "%1$[Dernière ouverture]@ %2$[aujourd’hui]@";
"%[Last Modified]@ %[Today]@" = "%1$[Dernière modification]@ %2$[aujourd’hui]@";
"%[Created]@ %[Today]@" = "%1$[Créé]@ %2$[aujourd’hui]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Dernière ouverture]@ %2$[depuis hier]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Dernière modification]@ %2$[depuis hier]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Créé]@ %2$[depuis hier]@";
"%[Last Opened]@ %[This week]@" = "%1$[Dernière ouverture]@ %2$[cette semaine]@";
"%[Last Modified]@ %[This week]@" = "%1$[Dernière modification]@ %2$[cette semaine]@";
"%[Created]@ %[This week]@" = "%1$[Créé]@ %2$[cette semaine]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Dernière ouverture]@ %2$[ces 2 dernières semaines]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Dernière modification]@ %2$[ces 2 dernières semaines]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Créé]@ %2$[ces 2 dernières semaines]@";
"%[Last Opened]@ %[This month]@" = "%1$[Dernière ouverture]@ %2$[ce mois-ci]@";
"%[Last Modified]@ %[This month]@" = "%1$[Dernière modification]@ %2$[ce mois-ci]@";
"%[Created]@ %[This month]@" = "%1$[Créé]@ %2$[ce mois-ci]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Dernière ouverture]@ %2$[ces 2 derniers mois]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Dernière modification]@ %2$[ces 2 derniers mois]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Créé]@ %2$[ces 2 derniers mois]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Dernière ouverture]@ %2$[exactement le]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Dernière modification]@ %2$[exactement le]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Créé]@ %2$[exactement le]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Dernière ouverture]@ %2$[avant le]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Dernière modification]@ %2$[avant]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Créé]@ %2$[avant le]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Dernière ouverture]@ %2$[après le]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Dernière modification]@ %2$[après]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Créé]@ %2$[après le]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Dernière ouverture]@ %2$[ces derniers]@ %3$@ %4$[jours]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Dernière modification]@ %2$[ces derniers]@ %3$@ %4$[jours]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Créé]@ %2$[ces derniers]@ %3$@ %4$[jours]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Dernière ouverture]@ %2$[ces dernières]@ %3$@ %4$[semaines]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Dernière modification]@ %2$[ces dernières]@ %3$@ %4$[semaines]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Créé]@ %2$[ces dernières]@ %3$@ %4$[semaines]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Dernière ouverture]@ %2$[ces derniers]@ %3$@ %4$[mois]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Dernière modification]@ %2$[ces derniers]@ %3$@ %4$[mois]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Créé]@ %2$[ces derniers]@ %3$@ %4$[mois]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Dernière ouverture]@ %2$[ces dernières]@ %3$@ %4$[années]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Dernière modification]@ %2$[ces dernières]@ %3$@ %4$[années]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Créé]@ %2$[ces dernières]@ %3$@ %4$[années]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Genre musical]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Extension de nom]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Le nom]@ %2$[contient]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Le nom]@ %2$[commence par]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Le nom]@ %2$[se termine par]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Le nom]@ %2$[est]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientation]@ %2$[toute orientation]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientation]@ %2$[paysage]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientation]@ %2$[portrait]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[autre…]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Requête brute]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Rechercher]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[La taille]@ %2$[est supérieure à]@ %3$@ %4$[Ko]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[La taille]@ %2$[est inférieure à]@ %3$@ %4$[Ko]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[La taille]@ %2$[est supérieure à]@ %3$@ %4$[Mo]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[La taille]@ %2$[est inférieure à]@ %3$@ %4$[Mo]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[La taille]@ %2$[est supérieure à]@ %3$@ %4$[Go]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[La taille]@ %2$[est inférieure à]@ %3$@ %4$[Go]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibilité]@ %2$[éléments visibles ou invisibles]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibilité]@ %2$[éléments visibles]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibilité]@ %2$[éléments invisibles]@";

